/* automatically generated by rust-bindgen 0.72.0 */

pub const WEBP_ENCODER_ABI_VERSION: u32 = 528;
pub const WEBP_MAX_DIMENSION: u32 = 16383;
pub const WEBP_DECODER_ABI_VERSION: u32 = 528;
pub const WEBP_MUX_ABI_VERSION: u32 = 265;
pub const WEBP_DEMUX_ABI_VERSION: u32 = 263;
unsafe extern "C" {
    pub fn WebPMalloc(size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn WebPFree(ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn WebPGetEncoderVersion() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPEncodeRGB(
        rgb: *const u8,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        stride: ::std::os::raw::c_int,
        quality_factor: f32,
        output: *mut *mut u8,
    ) -> usize;
}
unsafe extern "C" {
    pub fn WebPEncodeBGR(
        bgr: *const u8,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        stride: ::std::os::raw::c_int,
        quality_factor: f32,
        output: *mut *mut u8,
    ) -> usize;
}
unsafe extern "C" {
    pub fn WebPEncodeRGBA(
        rgba: *const u8,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        stride: ::std::os::raw::c_int,
        quality_factor: f32,
        output: *mut *mut u8,
    ) -> usize;
}
unsafe extern "C" {
    pub fn WebPEncodeBGRA(
        bgra: *const u8,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        stride: ::std::os::raw::c_int,
        quality_factor: f32,
        output: *mut *mut u8,
    ) -> usize;
}
unsafe extern "C" {
    pub fn WebPEncodeLosslessRGB(
        rgb: *const u8,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        stride: ::std::os::raw::c_int,
        output: *mut *mut u8,
    ) -> usize;
}
unsafe extern "C" {
    pub fn WebPEncodeLosslessBGR(
        bgr: *const u8,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        stride: ::std::os::raw::c_int,
        output: *mut *mut u8,
    ) -> usize;
}
unsafe extern "C" {
    pub fn WebPEncodeLosslessRGBA(
        rgba: *const u8,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        stride: ::std::os::raw::c_int,
        output: *mut *mut u8,
    ) -> usize;
}
unsafe extern "C" {
    pub fn WebPEncodeLosslessBGRA(
        bgra: *const u8,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        stride: ::std::os::raw::c_int,
        output: *mut *mut u8,
    ) -> usize;
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum WebPImageHint {
    WEBP_HINT_DEFAULT = 0,
    WEBP_HINT_PICTURE = 1,
    WEBP_HINT_PHOTO = 2,
    WEBP_HINT_GRAPH = 3,
    WEBP_HINT_LAST = 4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPConfig {
    pub lossless: ::std::os::raw::c_int,
    pub quality: f32,
    pub method: ::std::os::raw::c_int,
    pub image_hint: WebPImageHint,
    pub target_size: ::std::os::raw::c_int,
    pub target_PSNR: f32,
    pub segments: ::std::os::raw::c_int,
    pub sns_strength: ::std::os::raw::c_int,
    pub filter_strength: ::std::os::raw::c_int,
    pub filter_sharpness: ::std::os::raw::c_int,
    pub filter_type: ::std::os::raw::c_int,
    pub autofilter: ::std::os::raw::c_int,
    pub alpha_compression: ::std::os::raw::c_int,
    pub alpha_filtering: ::std::os::raw::c_int,
    pub alpha_quality: ::std::os::raw::c_int,
    pub pass: ::std::os::raw::c_int,
    pub show_compressed: ::std::os::raw::c_int,
    pub preprocessing: ::std::os::raw::c_int,
    pub partitions: ::std::os::raw::c_int,
    pub partition_limit: ::std::os::raw::c_int,
    pub emulate_jpeg_size: ::std::os::raw::c_int,
    pub thread_level: ::std::os::raw::c_int,
    pub low_memory: ::std::os::raw::c_int,
    pub near_lossless: ::std::os::raw::c_int,
    pub exact: ::std::os::raw::c_int,
    pub use_delta_palette: ::std::os::raw::c_int,
    pub use_sharp_yuv: ::std::os::raw::c_int,
    pub qmin: ::std::os::raw::c_int,
    pub qmax: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPConfig"][::std::mem::size_of::<WebPConfig>() - 116usize];
    ["Alignment of WebPConfig"][::std::mem::align_of::<WebPConfig>() - 4usize];
    ["Offset of field: WebPConfig::lossless"]
        [::std::mem::offset_of!(WebPConfig, lossless) - 0usize];
    ["Offset of field: WebPConfig::quality"][::std::mem::offset_of!(WebPConfig, quality) - 4usize];
    ["Offset of field: WebPConfig::method"][::std::mem::offset_of!(WebPConfig, method) - 8usize];
    ["Offset of field: WebPConfig::image_hint"]
        [::std::mem::offset_of!(WebPConfig, image_hint) - 12usize];
    ["Offset of field: WebPConfig::target_size"]
        [::std::mem::offset_of!(WebPConfig, target_size) - 16usize];
    ["Offset of field: WebPConfig::target_PSNR"]
        [::std::mem::offset_of!(WebPConfig, target_PSNR) - 20usize];
    ["Offset of field: WebPConfig::segments"]
        [::std::mem::offset_of!(WebPConfig, segments) - 24usize];
    ["Offset of field: WebPConfig::sns_strength"]
        [::std::mem::offset_of!(WebPConfig, sns_strength) - 28usize];
    ["Offset of field: WebPConfig::filter_strength"]
        [::std::mem::offset_of!(WebPConfig, filter_strength) - 32usize];
    ["Offset of field: WebPConfig::filter_sharpness"]
        [::std::mem::offset_of!(WebPConfig, filter_sharpness) - 36usize];
    ["Offset of field: WebPConfig::filter_type"]
        [::std::mem::offset_of!(WebPConfig, filter_type) - 40usize];
    ["Offset of field: WebPConfig::autofilter"]
        [::std::mem::offset_of!(WebPConfig, autofilter) - 44usize];
    ["Offset of field: WebPConfig::alpha_compression"]
        [::std::mem::offset_of!(WebPConfig, alpha_compression) - 48usize];
    ["Offset of field: WebPConfig::alpha_filtering"]
        [::std::mem::offset_of!(WebPConfig, alpha_filtering) - 52usize];
    ["Offset of field: WebPConfig::alpha_quality"]
        [::std::mem::offset_of!(WebPConfig, alpha_quality) - 56usize];
    ["Offset of field: WebPConfig::pass"][::std::mem::offset_of!(WebPConfig, pass) - 60usize];
    ["Offset of field: WebPConfig::show_compressed"]
        [::std::mem::offset_of!(WebPConfig, show_compressed) - 64usize];
    ["Offset of field: WebPConfig::preprocessing"]
        [::std::mem::offset_of!(WebPConfig, preprocessing) - 68usize];
    ["Offset of field: WebPConfig::partitions"]
        [::std::mem::offset_of!(WebPConfig, partitions) - 72usize];
    ["Offset of field: WebPConfig::partition_limit"]
        [::std::mem::offset_of!(WebPConfig, partition_limit) - 76usize];
    ["Offset of field: WebPConfig::emulate_jpeg_size"]
        [::std::mem::offset_of!(WebPConfig, emulate_jpeg_size) - 80usize];
    ["Offset of field: WebPConfig::thread_level"]
        [::std::mem::offset_of!(WebPConfig, thread_level) - 84usize];
    ["Offset of field: WebPConfig::low_memory"]
        [::std::mem::offset_of!(WebPConfig, low_memory) - 88usize];
    ["Offset of field: WebPConfig::near_lossless"]
        [::std::mem::offset_of!(WebPConfig, near_lossless) - 92usize];
    ["Offset of field: WebPConfig::exact"][::std::mem::offset_of!(WebPConfig, exact) - 96usize];
    ["Offset of field: WebPConfig::use_delta_palette"]
        [::std::mem::offset_of!(WebPConfig, use_delta_palette) - 100usize];
    ["Offset of field: WebPConfig::use_sharp_yuv"]
        [::std::mem::offset_of!(WebPConfig, use_sharp_yuv) - 104usize];
    ["Offset of field: WebPConfig::qmin"][::std::mem::offset_of!(WebPConfig, qmin) - 108usize];
    ["Offset of field: WebPConfig::qmax"][::std::mem::offset_of!(WebPConfig, qmax) - 112usize];
};
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum WebPPreset {
    WEBP_PRESET_DEFAULT = 0,
    WEBP_PRESET_PICTURE = 1,
    WEBP_PRESET_PHOTO = 2,
    WEBP_PRESET_DRAWING = 3,
    WEBP_PRESET_ICON = 4,
    WEBP_PRESET_TEXT = 5,
}
unsafe extern "C" {
    pub fn WebPConfigInitInternal(
        arg1: *mut WebPConfig,
        arg2: WebPPreset,
        arg3: f32,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPConfigLosslessPreset(
        config: *mut WebPConfig,
        level: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPValidateConfig(config: *const WebPConfig) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPAuxStats {
    pub coded_size: ::std::os::raw::c_int,
    pub PSNR: [f32; 5usize],
    pub block_count: [::std::os::raw::c_int; 3usize],
    pub header_bytes: [::std::os::raw::c_int; 2usize],
    pub residual_bytes: [[::std::os::raw::c_int; 4usize]; 3usize],
    pub segment_size: [::std::os::raw::c_int; 4usize],
    pub segment_quant: [::std::os::raw::c_int; 4usize],
    pub segment_level: [::std::os::raw::c_int; 4usize],
    pub alpha_data_size: ::std::os::raw::c_int,
    pub layer_data_size: ::std::os::raw::c_int,
    pub lossless_features: u32,
    pub histogram_bits: ::std::os::raw::c_int,
    pub transform_bits: ::std::os::raw::c_int,
    pub cache_bits: ::std::os::raw::c_int,
    pub palette_size: ::std::os::raw::c_int,
    pub lossless_size: ::std::os::raw::c_int,
    pub lossless_hdr_size: ::std::os::raw::c_int,
    pub lossless_data_size: ::std::os::raw::c_int,
    pub cross_color_transform_bits: ::std::os::raw::c_int,
    pub pad: [u32; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPAuxStats"][::std::mem::size_of::<WebPAuxStats>() - 188usize];
    ["Alignment of WebPAuxStats"][::std::mem::align_of::<WebPAuxStats>() - 4usize];
    ["Offset of field: WebPAuxStats::coded_size"]
        [::std::mem::offset_of!(WebPAuxStats, coded_size) - 0usize];
    ["Offset of field: WebPAuxStats::PSNR"][::std::mem::offset_of!(WebPAuxStats, PSNR) - 4usize];
    ["Offset of field: WebPAuxStats::block_count"]
        [::std::mem::offset_of!(WebPAuxStats, block_count) - 24usize];
    ["Offset of field: WebPAuxStats::header_bytes"]
        [::std::mem::offset_of!(WebPAuxStats, header_bytes) - 36usize];
    ["Offset of field: WebPAuxStats::residual_bytes"]
        [::std::mem::offset_of!(WebPAuxStats, residual_bytes) - 44usize];
    ["Offset of field: WebPAuxStats::segment_size"]
        [::std::mem::offset_of!(WebPAuxStats, segment_size) - 92usize];
    ["Offset of field: WebPAuxStats::segment_quant"]
        [::std::mem::offset_of!(WebPAuxStats, segment_quant) - 108usize];
    ["Offset of field: WebPAuxStats::segment_level"]
        [::std::mem::offset_of!(WebPAuxStats, segment_level) - 124usize];
    ["Offset of field: WebPAuxStats::alpha_data_size"]
        [::std::mem::offset_of!(WebPAuxStats, alpha_data_size) - 140usize];
    ["Offset of field: WebPAuxStats::layer_data_size"]
        [::std::mem::offset_of!(WebPAuxStats, layer_data_size) - 144usize];
    ["Offset of field: WebPAuxStats::lossless_features"]
        [::std::mem::offset_of!(WebPAuxStats, lossless_features) - 148usize];
    ["Offset of field: WebPAuxStats::histogram_bits"]
        [::std::mem::offset_of!(WebPAuxStats, histogram_bits) - 152usize];
    ["Offset of field: WebPAuxStats::transform_bits"]
        [::std::mem::offset_of!(WebPAuxStats, transform_bits) - 156usize];
    ["Offset of field: WebPAuxStats::cache_bits"]
        [::std::mem::offset_of!(WebPAuxStats, cache_bits) - 160usize];
    ["Offset of field: WebPAuxStats::palette_size"]
        [::std::mem::offset_of!(WebPAuxStats, palette_size) - 164usize];
    ["Offset of field: WebPAuxStats::lossless_size"]
        [::std::mem::offset_of!(WebPAuxStats, lossless_size) - 168usize];
    ["Offset of field: WebPAuxStats::lossless_hdr_size"]
        [::std::mem::offset_of!(WebPAuxStats, lossless_hdr_size) - 172usize];
    ["Offset of field: WebPAuxStats::lossless_data_size"]
        [::std::mem::offset_of!(WebPAuxStats, lossless_data_size) - 176usize];
    ["Offset of field: WebPAuxStats::cross_color_transform_bits"]
        [::std::mem::offset_of!(WebPAuxStats, cross_color_transform_bits) - 180usize];
    ["Offset of field: WebPAuxStats::pad"][::std::mem::offset_of!(WebPAuxStats, pad) - 184usize];
};
pub type WebPWriterFunction = ::std::option::Option<
    unsafe extern "C" fn(
        data: *const u8,
        data_size: usize,
        picture: *const WebPPicture,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPMemoryWriter {
    pub mem: *mut u8,
    pub size: usize,
    pub max_size: usize,
    pub pad: [u32; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPMemoryWriter"][::std::mem::size_of::<WebPMemoryWriter>() - 32usize];
    ["Alignment of WebPMemoryWriter"][::std::mem::align_of::<WebPMemoryWriter>() - 8usize];
    ["Offset of field: WebPMemoryWriter::mem"]
        [::std::mem::offset_of!(WebPMemoryWriter, mem) - 0usize];
    ["Offset of field: WebPMemoryWriter::size"]
        [::std::mem::offset_of!(WebPMemoryWriter, size) - 8usize];
    ["Offset of field: WebPMemoryWriter::max_size"]
        [::std::mem::offset_of!(WebPMemoryWriter, max_size) - 16usize];
    ["Offset of field: WebPMemoryWriter::pad"]
        [::std::mem::offset_of!(WebPMemoryWriter, pad) - 24usize];
};
unsafe extern "C" {
    pub fn WebPMemoryWriterInit(writer: *mut WebPMemoryWriter);
}
unsafe extern "C" {
    pub fn WebPMemoryWriterClear(writer: *mut WebPMemoryWriter);
}
unsafe extern "C" {
    pub fn WebPMemoryWrite(
        data: *const u8,
        data_size: usize,
        picture: *const WebPPicture,
    ) -> ::std::os::raw::c_int;
}
pub type WebPProgressHook = ::std::option::Option<
    unsafe extern "C" fn(
        percent: ::std::os::raw::c_int,
        picture: *const WebPPicture,
    ) -> ::std::os::raw::c_int,
>;
impl WebPEncCSP {
    pub const WEBP_CSP_ALPHA_BIT: WebPEncCSP = WebPEncCSP::WEBP_YUV420A;
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum WebPEncCSP {
    WEBP_YUV420 = 0,
    WEBP_YUV420A = 4,
    WEBP_CSP_UV_MASK = 3,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum WebPEncodingError {
    VP8_ENC_OK = 0,
    VP8_ENC_ERROR_OUT_OF_MEMORY = 1,
    VP8_ENC_ERROR_BITSTREAM_OUT_OF_MEMORY = 2,
    VP8_ENC_ERROR_NULL_PARAMETER = 3,
    VP8_ENC_ERROR_INVALID_CONFIGURATION = 4,
    VP8_ENC_ERROR_BAD_DIMENSION = 5,
    VP8_ENC_ERROR_PARTITION0_OVERFLOW = 6,
    VP8_ENC_ERROR_PARTITION_OVERFLOW = 7,
    VP8_ENC_ERROR_BAD_WRITE = 8,
    VP8_ENC_ERROR_FILE_TOO_BIG = 9,
    VP8_ENC_ERROR_USER_ABORT = 10,
    VP8_ENC_ERROR_LAST = 11,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPPicture {
    pub use_argb: ::std::os::raw::c_int,
    pub colorspace: WebPEncCSP,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub y: *mut u8,
    pub u: *mut u8,
    pub v: *mut u8,
    pub y_stride: ::std::os::raw::c_int,
    pub uv_stride: ::std::os::raw::c_int,
    pub a: *mut u8,
    pub a_stride: ::std::os::raw::c_int,
    pub pad1: [u32; 2usize],
    pub argb: *mut u32,
    pub argb_stride: ::std::os::raw::c_int,
    pub pad2: [u32; 3usize],
    pub writer: WebPWriterFunction,
    pub custom_ptr: *mut ::std::os::raw::c_void,
    pub extra_info_type: ::std::os::raw::c_int,
    pub extra_info: *mut u8,
    pub stats: *mut WebPAuxStats,
    pub error_code: WebPEncodingError,
    pub progress_hook: WebPProgressHook,
    pub user_data: *mut ::std::os::raw::c_void,
    pub pad3: [u32; 3usize],
    pub pad4: *mut u8,
    pub pad5: *mut u8,
    pub pad6: [u32; 8usize],
    pub memory_: *mut ::std::os::raw::c_void,
    pub memory_argb_: *mut ::std::os::raw::c_void,
    pub pad7: [*mut ::std::os::raw::c_void; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPPicture"][::std::mem::size_of::<WebPPicture>() - 256usize];
    ["Alignment of WebPPicture"][::std::mem::align_of::<WebPPicture>() - 8usize];
    ["Offset of field: WebPPicture::use_argb"]
        [::std::mem::offset_of!(WebPPicture, use_argb) - 0usize];
    ["Offset of field: WebPPicture::colorspace"]
        [::std::mem::offset_of!(WebPPicture, colorspace) - 4usize];
    ["Offset of field: WebPPicture::width"][::std::mem::offset_of!(WebPPicture, width) - 8usize];
    ["Offset of field: WebPPicture::height"][::std::mem::offset_of!(WebPPicture, height) - 12usize];
    ["Offset of field: WebPPicture::y"][::std::mem::offset_of!(WebPPicture, y) - 16usize];
    ["Offset of field: WebPPicture::u"][::std::mem::offset_of!(WebPPicture, u) - 24usize];
    ["Offset of field: WebPPicture::v"][::std::mem::offset_of!(WebPPicture, v) - 32usize];
    ["Offset of field: WebPPicture::y_stride"]
        [::std::mem::offset_of!(WebPPicture, y_stride) - 40usize];
    ["Offset of field: WebPPicture::uv_stride"]
        [::std::mem::offset_of!(WebPPicture, uv_stride) - 44usize];
    ["Offset of field: WebPPicture::a"][::std::mem::offset_of!(WebPPicture, a) - 48usize];
    ["Offset of field: WebPPicture::a_stride"]
        [::std::mem::offset_of!(WebPPicture, a_stride) - 56usize];
    ["Offset of field: WebPPicture::pad1"][::std::mem::offset_of!(WebPPicture, pad1) - 60usize];
    ["Offset of field: WebPPicture::argb"][::std::mem::offset_of!(WebPPicture, argb) - 72usize];
    ["Offset of field: WebPPicture::argb_stride"]
        [::std::mem::offset_of!(WebPPicture, argb_stride) - 80usize];
    ["Offset of field: WebPPicture::pad2"][::std::mem::offset_of!(WebPPicture, pad2) - 84usize];
    ["Offset of field: WebPPicture::writer"][::std::mem::offset_of!(WebPPicture, writer) - 96usize];
    ["Offset of field: WebPPicture::custom_ptr"]
        [::std::mem::offset_of!(WebPPicture, custom_ptr) - 104usize];
    ["Offset of field: WebPPicture::extra_info_type"]
        [::std::mem::offset_of!(WebPPicture, extra_info_type) - 112usize];
    ["Offset of field: WebPPicture::extra_info"]
        [::std::mem::offset_of!(WebPPicture, extra_info) - 120usize];
    ["Offset of field: WebPPicture::stats"][::std::mem::offset_of!(WebPPicture, stats) - 128usize];
    ["Offset of field: WebPPicture::error_code"]
        [::std::mem::offset_of!(WebPPicture, error_code) - 136usize];
    ["Offset of field: WebPPicture::progress_hook"]
        [::std::mem::offset_of!(WebPPicture, progress_hook) - 144usize];
    ["Offset of field: WebPPicture::user_data"]
        [::std::mem::offset_of!(WebPPicture, user_data) - 152usize];
    ["Offset of field: WebPPicture::pad3"][::std::mem::offset_of!(WebPPicture, pad3) - 160usize];
    ["Offset of field: WebPPicture::pad4"][::std::mem::offset_of!(WebPPicture, pad4) - 176usize];
    ["Offset of field: WebPPicture::pad5"][::std::mem::offset_of!(WebPPicture, pad5) - 184usize];
    ["Offset of field: WebPPicture::pad6"][::std::mem::offset_of!(WebPPicture, pad6) - 192usize];
    ["Offset of field: WebPPicture::memory_"]
        [::std::mem::offset_of!(WebPPicture, memory_) - 224usize];
    ["Offset of field: WebPPicture::memory_argb_"]
        [::std::mem::offset_of!(WebPPicture, memory_argb_) - 232usize];
    ["Offset of field: WebPPicture::pad7"][::std::mem::offset_of!(WebPPicture, pad7) - 240usize];
};
unsafe extern "C" {
    pub fn WebPPictureInitInternal(
        arg1: *mut WebPPicture,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureAlloc(picture: *mut WebPPicture) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureFree(picture: *mut WebPPicture);
}
unsafe extern "C" {
    pub fn WebPPictureCopy(src: *const WebPPicture, dst: *mut WebPPicture)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPlaneDistortion(
        src: *const u8,
        src_stride: usize,
        ref_: *const u8,
        ref_stride: usize,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        x_step: usize,
        type_: ::std::os::raw::c_int,
        distortion: *mut f32,
        result: *mut f32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureDistortion(
        src: *const WebPPicture,
        ref_: *const WebPPicture,
        metric_type: ::std::os::raw::c_int,
        result: *mut f32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureCrop(
        picture: *mut WebPPicture,
        left: ::std::os::raw::c_int,
        top: ::std::os::raw::c_int,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureView(
        src: *const WebPPicture,
        left: ::std::os::raw::c_int,
        top: ::std::os::raw::c_int,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        dst: *mut WebPPicture,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureIsView(picture: *const WebPPicture) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureRescale(
        picture: *mut WebPPicture,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureImportRGB(
        picture: *mut WebPPicture,
        rgb: *const u8,
        rgb_stride: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureImportRGBA(
        picture: *mut WebPPicture,
        rgba: *const u8,
        rgba_stride: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureImportRGBX(
        picture: *mut WebPPicture,
        rgbx: *const u8,
        rgbx_stride: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureImportBGR(
        picture: *mut WebPPicture,
        bgr: *const u8,
        bgr_stride: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureImportBGRA(
        picture: *mut WebPPicture,
        bgra: *const u8,
        bgra_stride: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureImportBGRX(
        picture: *mut WebPPicture,
        bgrx: *const u8,
        bgrx_stride: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureARGBToYUVA(
        picture: *mut WebPPicture,
        arg1: WebPEncCSP,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureARGBToYUVADithered(
        picture: *mut WebPPicture,
        colorspace: WebPEncCSP,
        dithering: f32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureSharpARGBToYUVA(picture: *mut WebPPicture) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureSmartARGBToYUVA(picture: *mut WebPPicture) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPPictureYUVAToARGB(picture: *mut WebPPicture) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPCleanupTransparentArea(picture: *mut WebPPicture);
}
unsafe extern "C" {
    pub fn WebPPictureHasTransparency(picture: *const WebPPicture) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPBlendAlpha(picture: *mut WebPPicture, background_rgb: u32);
}
unsafe extern "C" {
    pub fn WebPEncode(
        config: *const WebPConfig,
        picture: *mut WebPPicture,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPIDecoder {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn WebPGetDecoderVersion() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPGetInfo(
        data: *const u8,
        data_size: usize,
        width: *mut ::std::os::raw::c_int,
        height: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPDecodeRGBA(
        data: *const u8,
        data_size: usize,
        width: *mut ::std::os::raw::c_int,
        height: *mut ::std::os::raw::c_int,
    ) -> *mut u8;
}
unsafe extern "C" {
    pub fn WebPDecodeARGB(
        data: *const u8,
        data_size: usize,
        width: *mut ::std::os::raw::c_int,
        height: *mut ::std::os::raw::c_int,
    ) -> *mut u8;
}
unsafe extern "C" {
    pub fn WebPDecodeBGRA(
        data: *const u8,
        data_size: usize,
        width: *mut ::std::os::raw::c_int,
        height: *mut ::std::os::raw::c_int,
    ) -> *mut u8;
}
unsafe extern "C" {
    pub fn WebPDecodeRGB(
        data: *const u8,
        data_size: usize,
        width: *mut ::std::os::raw::c_int,
        height: *mut ::std::os::raw::c_int,
    ) -> *mut u8;
}
unsafe extern "C" {
    pub fn WebPDecodeBGR(
        data: *const u8,
        data_size: usize,
        width: *mut ::std::os::raw::c_int,
        height: *mut ::std::os::raw::c_int,
    ) -> *mut u8;
}
unsafe extern "C" {
    pub fn WebPDecodeYUV(
        data: *const u8,
        data_size: usize,
        width: *mut ::std::os::raw::c_int,
        height: *mut ::std::os::raw::c_int,
        u: *mut *mut u8,
        v: *mut *mut u8,
        stride: *mut ::std::os::raw::c_int,
        uv_stride: *mut ::std::os::raw::c_int,
    ) -> *mut u8;
}
unsafe extern "C" {
    pub fn WebPDecodeRGBAInto(
        data: *const u8,
        data_size: usize,
        output_buffer: *mut u8,
        output_buffer_size: usize,
        output_stride: ::std::os::raw::c_int,
    ) -> *mut u8;
}
unsafe extern "C" {
    pub fn WebPDecodeARGBInto(
        data: *const u8,
        data_size: usize,
        output_buffer: *mut u8,
        output_buffer_size: usize,
        output_stride: ::std::os::raw::c_int,
    ) -> *mut u8;
}
unsafe extern "C" {
    pub fn WebPDecodeBGRAInto(
        data: *const u8,
        data_size: usize,
        output_buffer: *mut u8,
        output_buffer_size: usize,
        output_stride: ::std::os::raw::c_int,
    ) -> *mut u8;
}
unsafe extern "C" {
    pub fn WebPDecodeRGBInto(
        data: *const u8,
        data_size: usize,
        output_buffer: *mut u8,
        output_buffer_size: usize,
        output_stride: ::std::os::raw::c_int,
    ) -> *mut u8;
}
unsafe extern "C" {
    pub fn WebPDecodeBGRInto(
        data: *const u8,
        data_size: usize,
        output_buffer: *mut u8,
        output_buffer_size: usize,
        output_stride: ::std::os::raw::c_int,
    ) -> *mut u8;
}
unsafe extern "C" {
    pub fn WebPDecodeYUVInto(
        data: *const u8,
        data_size: usize,
        luma: *mut u8,
        luma_size: usize,
        luma_stride: ::std::os::raw::c_int,
        u: *mut u8,
        u_size: usize,
        u_stride: ::std::os::raw::c_int,
        v: *mut u8,
        v_size: usize,
        v_stride: ::std::os::raw::c_int,
    ) -> *mut u8;
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum WEBP_CSP_MODE {
    MODE_RGB = 0,
    MODE_RGBA = 1,
    MODE_BGR = 2,
    MODE_BGRA = 3,
    MODE_ARGB = 4,
    MODE_RGBA_4444 = 5,
    MODE_RGB_565 = 6,
    MODE_rgbA = 7,
    MODE_bgrA = 8,
    MODE_Argb = 9,
    MODE_rgbA_4444 = 10,
    MODE_YUV = 11,
    MODE_YUVA = 12,
    MODE_LAST = 13,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPRGBABuffer {
    pub rgba: *mut u8,
    pub stride: ::std::os::raw::c_int,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPRGBABuffer"][::std::mem::size_of::<WebPRGBABuffer>() - 24usize];
    ["Alignment of WebPRGBABuffer"][::std::mem::align_of::<WebPRGBABuffer>() - 8usize];
    ["Offset of field: WebPRGBABuffer::rgba"]
        [::std::mem::offset_of!(WebPRGBABuffer, rgba) - 0usize];
    ["Offset of field: WebPRGBABuffer::stride"]
        [::std::mem::offset_of!(WebPRGBABuffer, stride) - 8usize];
    ["Offset of field: WebPRGBABuffer::size"]
        [::std::mem::offset_of!(WebPRGBABuffer, size) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPYUVABuffer {
    pub y: *mut u8,
    pub u: *mut u8,
    pub v: *mut u8,
    pub a: *mut u8,
    pub y_stride: ::std::os::raw::c_int,
    pub u_stride: ::std::os::raw::c_int,
    pub v_stride: ::std::os::raw::c_int,
    pub a_stride: ::std::os::raw::c_int,
    pub y_size: usize,
    pub u_size: usize,
    pub v_size: usize,
    pub a_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPYUVABuffer"][::std::mem::size_of::<WebPYUVABuffer>() - 80usize];
    ["Alignment of WebPYUVABuffer"][::std::mem::align_of::<WebPYUVABuffer>() - 8usize];
    ["Offset of field: WebPYUVABuffer::y"][::std::mem::offset_of!(WebPYUVABuffer, y) - 0usize];
    ["Offset of field: WebPYUVABuffer::u"][::std::mem::offset_of!(WebPYUVABuffer, u) - 8usize];
    ["Offset of field: WebPYUVABuffer::v"][::std::mem::offset_of!(WebPYUVABuffer, v) - 16usize];
    ["Offset of field: WebPYUVABuffer::a"][::std::mem::offset_of!(WebPYUVABuffer, a) - 24usize];
    ["Offset of field: WebPYUVABuffer::y_stride"]
        [::std::mem::offset_of!(WebPYUVABuffer, y_stride) - 32usize];
    ["Offset of field: WebPYUVABuffer::u_stride"]
        [::std::mem::offset_of!(WebPYUVABuffer, u_stride) - 36usize];
    ["Offset of field: WebPYUVABuffer::v_stride"]
        [::std::mem::offset_of!(WebPYUVABuffer, v_stride) - 40usize];
    ["Offset of field: WebPYUVABuffer::a_stride"]
        [::std::mem::offset_of!(WebPYUVABuffer, a_stride) - 44usize];
    ["Offset of field: WebPYUVABuffer::y_size"]
        [::std::mem::offset_of!(WebPYUVABuffer, y_size) - 48usize];
    ["Offset of field: WebPYUVABuffer::u_size"]
        [::std::mem::offset_of!(WebPYUVABuffer, u_size) - 56usize];
    ["Offset of field: WebPYUVABuffer::v_size"]
        [::std::mem::offset_of!(WebPYUVABuffer, v_size) - 64usize];
    ["Offset of field: WebPYUVABuffer::a_size"]
        [::std::mem::offset_of!(WebPYUVABuffer, a_size) - 72usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct WebPDecBuffer {
    pub colorspace: WEBP_CSP_MODE,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub is_external_memory: ::std::os::raw::c_int,
    pub u: WebPDecBuffer__bindgen_ty_1,
    pub pad: [u32; 4usize],
    pub private_memory: *mut u8,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union WebPDecBuffer__bindgen_ty_1 {
    pub RGBA: WebPRGBABuffer,
    pub YUVA: WebPYUVABuffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPDecBuffer__bindgen_ty_1"]
        [::std::mem::size_of::<WebPDecBuffer__bindgen_ty_1>() - 80usize];
    ["Alignment of WebPDecBuffer__bindgen_ty_1"]
        [::std::mem::align_of::<WebPDecBuffer__bindgen_ty_1>() - 8usize];
    ["Offset of field: WebPDecBuffer__bindgen_ty_1::RGBA"]
        [::std::mem::offset_of!(WebPDecBuffer__bindgen_ty_1, RGBA) - 0usize];
    ["Offset of field: WebPDecBuffer__bindgen_ty_1::YUVA"]
        [::std::mem::offset_of!(WebPDecBuffer__bindgen_ty_1, YUVA) - 0usize];
};
impl ::std::fmt::Debug for WebPDecBuffer__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "WebPDecBuffer__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPDecBuffer"][::std::mem::size_of::<WebPDecBuffer>() - 120usize];
    ["Alignment of WebPDecBuffer"][::std::mem::align_of::<WebPDecBuffer>() - 8usize];
    ["Offset of field: WebPDecBuffer::colorspace"]
        [::std::mem::offset_of!(WebPDecBuffer, colorspace) - 0usize];
    ["Offset of field: WebPDecBuffer::width"]
        [::std::mem::offset_of!(WebPDecBuffer, width) - 4usize];
    ["Offset of field: WebPDecBuffer::height"]
        [::std::mem::offset_of!(WebPDecBuffer, height) - 8usize];
    ["Offset of field: WebPDecBuffer::is_external_memory"]
        [::std::mem::offset_of!(WebPDecBuffer, is_external_memory) - 12usize];
    ["Offset of field: WebPDecBuffer::u"][::std::mem::offset_of!(WebPDecBuffer, u) - 16usize];
    ["Offset of field: WebPDecBuffer::pad"][::std::mem::offset_of!(WebPDecBuffer, pad) - 96usize];
    ["Offset of field: WebPDecBuffer::private_memory"]
        [::std::mem::offset_of!(WebPDecBuffer, private_memory) - 112usize];
};
impl ::std::fmt::Debug for WebPDecBuffer {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "WebPDecBuffer {{ colorspace: {:?}, width: {:?}, height: {:?}, is_external_memory: {:?}, u: {:?}, pad: {:?}, private_memory: {:?} }}",
            self.colorspace,
            self.width,
            self.height,
            self.is_external_memory,
            self.u,
            self.pad,
            self.private_memory
        )
    }
}
unsafe extern "C" {
    pub fn WebPInitDecBufferInternal(
        arg1: *mut WebPDecBuffer,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPFreeDecBuffer(buffer: *mut WebPDecBuffer);
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum VP8StatusCode {
    VP8_STATUS_OK = 0,
    VP8_STATUS_OUT_OF_MEMORY = 1,
    VP8_STATUS_INVALID_PARAM = 2,
    VP8_STATUS_BITSTREAM_ERROR = 3,
    VP8_STATUS_UNSUPPORTED_FEATURE = 4,
    VP8_STATUS_SUSPENDED = 5,
    VP8_STATUS_USER_ABORT = 6,
    VP8_STATUS_NOT_ENOUGH_DATA = 7,
}
unsafe extern "C" {
    pub fn WebPINewDecoder(output_buffer: *mut WebPDecBuffer) -> *mut WebPIDecoder;
}
unsafe extern "C" {
    pub fn WebPINewRGB(
        csp: WEBP_CSP_MODE,
        output_buffer: *mut u8,
        output_buffer_size: usize,
        output_stride: ::std::os::raw::c_int,
    ) -> *mut WebPIDecoder;
}
unsafe extern "C" {
    pub fn WebPINewYUVA(
        luma: *mut u8,
        luma_size: usize,
        luma_stride: ::std::os::raw::c_int,
        u: *mut u8,
        u_size: usize,
        u_stride: ::std::os::raw::c_int,
        v: *mut u8,
        v_size: usize,
        v_stride: ::std::os::raw::c_int,
        a: *mut u8,
        a_size: usize,
        a_stride: ::std::os::raw::c_int,
    ) -> *mut WebPIDecoder;
}
unsafe extern "C" {
    pub fn WebPINewYUV(
        luma: *mut u8,
        luma_size: usize,
        luma_stride: ::std::os::raw::c_int,
        u: *mut u8,
        u_size: usize,
        u_stride: ::std::os::raw::c_int,
        v: *mut u8,
        v_size: usize,
        v_stride: ::std::os::raw::c_int,
    ) -> *mut WebPIDecoder;
}
unsafe extern "C" {
    pub fn WebPIDelete(idec: *mut WebPIDecoder);
}
unsafe extern "C" {
    pub fn WebPIAppend(idec: *mut WebPIDecoder, data: *const u8, data_size: usize)
    -> VP8StatusCode;
}
unsafe extern "C" {
    pub fn WebPIUpdate(idec: *mut WebPIDecoder, data: *const u8, data_size: usize)
    -> VP8StatusCode;
}
unsafe extern "C" {
    pub fn WebPIDecGetRGB(
        idec: *const WebPIDecoder,
        last_y: *mut ::std::os::raw::c_int,
        width: *mut ::std::os::raw::c_int,
        height: *mut ::std::os::raw::c_int,
        stride: *mut ::std::os::raw::c_int,
    ) -> *mut u8;
}
unsafe extern "C" {
    pub fn WebPIDecGetYUVA(
        idec: *const WebPIDecoder,
        last_y: *mut ::std::os::raw::c_int,
        u: *mut *mut u8,
        v: *mut *mut u8,
        a: *mut *mut u8,
        width: *mut ::std::os::raw::c_int,
        height: *mut ::std::os::raw::c_int,
        stride: *mut ::std::os::raw::c_int,
        uv_stride: *mut ::std::os::raw::c_int,
        a_stride: *mut ::std::os::raw::c_int,
    ) -> *mut u8;
}
unsafe extern "C" {
    pub fn WebPIDecodedArea(
        idec: *const WebPIDecoder,
        left: *mut ::std::os::raw::c_int,
        top: *mut ::std::os::raw::c_int,
        width: *mut ::std::os::raw::c_int,
        height: *mut ::std::os::raw::c_int,
    ) -> *const WebPDecBuffer;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPBitstreamFeatures {
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub has_alpha: ::std::os::raw::c_int,
    pub has_animation: ::std::os::raw::c_int,
    pub format: ::std::os::raw::c_int,
    pub pad: [u32; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPBitstreamFeatures"][::std::mem::size_of::<WebPBitstreamFeatures>() - 40usize];
    ["Alignment of WebPBitstreamFeatures"]
        [::std::mem::align_of::<WebPBitstreamFeatures>() - 4usize];
    ["Offset of field: WebPBitstreamFeatures::width"]
        [::std::mem::offset_of!(WebPBitstreamFeatures, width) - 0usize];
    ["Offset of field: WebPBitstreamFeatures::height"]
        [::std::mem::offset_of!(WebPBitstreamFeatures, height) - 4usize];
    ["Offset of field: WebPBitstreamFeatures::has_alpha"]
        [::std::mem::offset_of!(WebPBitstreamFeatures, has_alpha) - 8usize];
    ["Offset of field: WebPBitstreamFeatures::has_animation"]
        [::std::mem::offset_of!(WebPBitstreamFeatures, has_animation) - 12usize];
    ["Offset of field: WebPBitstreamFeatures::format"]
        [::std::mem::offset_of!(WebPBitstreamFeatures, format) - 16usize];
    ["Offset of field: WebPBitstreamFeatures::pad"]
        [::std::mem::offset_of!(WebPBitstreamFeatures, pad) - 20usize];
};
unsafe extern "C" {
    pub fn WebPGetFeaturesInternal(
        arg1: *const u8,
        arg2: usize,
        arg3: *mut WebPBitstreamFeatures,
        arg4: ::std::os::raw::c_int,
    ) -> VP8StatusCode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPDecoderOptions {
    pub bypass_filtering: ::std::os::raw::c_int,
    pub no_fancy_upsampling: ::std::os::raw::c_int,
    pub use_cropping: ::std::os::raw::c_int,
    pub crop_left: ::std::os::raw::c_int,
    pub crop_top: ::std::os::raw::c_int,
    pub crop_width: ::std::os::raw::c_int,
    pub crop_height: ::std::os::raw::c_int,
    pub use_scaling: ::std::os::raw::c_int,
    pub scaled_width: ::std::os::raw::c_int,
    pub scaled_height: ::std::os::raw::c_int,
    pub use_threads: ::std::os::raw::c_int,
    pub dithering_strength: ::std::os::raw::c_int,
    pub flip: ::std::os::raw::c_int,
    pub alpha_dithering_strength: ::std::os::raw::c_int,
    pub pad: [u32; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPDecoderOptions"][::std::mem::size_of::<WebPDecoderOptions>() - 76usize];
    ["Alignment of WebPDecoderOptions"][::std::mem::align_of::<WebPDecoderOptions>() - 4usize];
    ["Offset of field: WebPDecoderOptions::bypass_filtering"]
        [::std::mem::offset_of!(WebPDecoderOptions, bypass_filtering) - 0usize];
    ["Offset of field: WebPDecoderOptions::no_fancy_upsampling"]
        [::std::mem::offset_of!(WebPDecoderOptions, no_fancy_upsampling) - 4usize];
    ["Offset of field: WebPDecoderOptions::use_cropping"]
        [::std::mem::offset_of!(WebPDecoderOptions, use_cropping) - 8usize];
    ["Offset of field: WebPDecoderOptions::crop_left"]
        [::std::mem::offset_of!(WebPDecoderOptions, crop_left) - 12usize];
    ["Offset of field: WebPDecoderOptions::crop_top"]
        [::std::mem::offset_of!(WebPDecoderOptions, crop_top) - 16usize];
    ["Offset of field: WebPDecoderOptions::crop_width"]
        [::std::mem::offset_of!(WebPDecoderOptions, crop_width) - 20usize];
    ["Offset of field: WebPDecoderOptions::crop_height"]
        [::std::mem::offset_of!(WebPDecoderOptions, crop_height) - 24usize];
    ["Offset of field: WebPDecoderOptions::use_scaling"]
        [::std::mem::offset_of!(WebPDecoderOptions, use_scaling) - 28usize];
    ["Offset of field: WebPDecoderOptions::scaled_width"]
        [::std::mem::offset_of!(WebPDecoderOptions, scaled_width) - 32usize];
    ["Offset of field: WebPDecoderOptions::scaled_height"]
        [::std::mem::offset_of!(WebPDecoderOptions, scaled_height) - 36usize];
    ["Offset of field: WebPDecoderOptions::use_threads"]
        [::std::mem::offset_of!(WebPDecoderOptions, use_threads) - 40usize];
    ["Offset of field: WebPDecoderOptions::dithering_strength"]
        [::std::mem::offset_of!(WebPDecoderOptions, dithering_strength) - 44usize];
    ["Offset of field: WebPDecoderOptions::flip"]
        [::std::mem::offset_of!(WebPDecoderOptions, flip) - 48usize];
    ["Offset of field: WebPDecoderOptions::alpha_dithering_strength"]
        [::std::mem::offset_of!(WebPDecoderOptions, alpha_dithering_strength) - 52usize];
    ["Offset of field: WebPDecoderOptions::pad"]
        [::std::mem::offset_of!(WebPDecoderOptions, pad) - 56usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct WebPDecoderConfig {
    pub input: WebPBitstreamFeatures,
    pub output: WebPDecBuffer,
    pub options: WebPDecoderOptions,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPDecoderConfig"][::std::mem::size_of::<WebPDecoderConfig>() - 240usize];
    ["Alignment of WebPDecoderConfig"][::std::mem::align_of::<WebPDecoderConfig>() - 8usize];
    ["Offset of field: WebPDecoderConfig::input"]
        [::std::mem::offset_of!(WebPDecoderConfig, input) - 0usize];
    ["Offset of field: WebPDecoderConfig::output"]
        [::std::mem::offset_of!(WebPDecoderConfig, output) - 40usize];
    ["Offset of field: WebPDecoderConfig::options"]
        [::std::mem::offset_of!(WebPDecoderConfig, options) - 160usize];
};
impl ::std::fmt::Debug for WebPDecoderConfig {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "WebPDecoderConfig {{ input: {:?}, output: {:?}, options: {:?} }}",
            self.input, self.output, self.options
        )
    }
}
unsafe extern "C" {
    pub fn WebPInitDecoderConfigInternal(
        arg1: *mut WebPDecoderConfig,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPValidateDecoderConfig(config: *const WebPDecoderConfig) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPIDecode(
        data: *const u8,
        data_size: usize,
        config: *mut WebPDecoderConfig,
    ) -> *mut WebPIDecoder;
}
unsafe extern "C" {
    pub fn WebPDecode(
        data: *const u8,
        data_size: usize,
        config: *mut WebPDecoderConfig,
    ) -> VP8StatusCode;
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum WebPFeatureFlags {
    ANIMATION_FLAG = 2,
    XMP_FLAG = 4,
    EXIF_FLAG = 8,
    ALPHA_FLAG = 16,
    ICCP_FLAG = 32,
    ALL_VALID_FLAGS = 62,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum WebPMuxAnimDispose {
    WEBP_MUX_DISPOSE_NONE = 0,
    WEBP_MUX_DISPOSE_BACKGROUND = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum WebPMuxAnimBlend {
    WEBP_MUX_BLEND = 0,
    WEBP_MUX_NO_BLEND = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPData {
    pub bytes: *const u8,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPData"][::std::mem::size_of::<WebPData>() - 16usize];
    ["Alignment of WebPData"][::std::mem::align_of::<WebPData>() - 8usize];
    ["Offset of field: WebPData::bytes"][::std::mem::offset_of!(WebPData, bytes) - 0usize];
    ["Offset of field: WebPData::size"][::std::mem::offset_of!(WebPData, size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPMux {
    _unused: [u8; 0],
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum WebPMuxError {
    WEBP_MUX_OK = 1,
    WEBP_MUX_NOT_FOUND = 0,
    WEBP_MUX_INVALID_ARGUMENT = -1,
    WEBP_MUX_BAD_DATA = -2,
    WEBP_MUX_MEMORY_ERROR = -3,
    WEBP_MUX_NOT_ENOUGH_DATA = -4,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum WebPChunkId {
    WEBP_CHUNK_VP8X = 0,
    WEBP_CHUNK_ICCP = 1,
    WEBP_CHUNK_ANIM = 2,
    WEBP_CHUNK_ANMF = 3,
    WEBP_CHUNK_DEPRECATED = 4,
    WEBP_CHUNK_ALPHA = 5,
    WEBP_CHUNK_IMAGE = 6,
    WEBP_CHUNK_EXIF = 7,
    WEBP_CHUNK_XMP = 8,
    WEBP_CHUNK_UNKNOWN = 9,
    WEBP_CHUNK_NIL = 10,
}
unsafe extern "C" {
    pub fn WebPGetMuxVersion() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPNewInternal(arg1: ::std::os::raw::c_int) -> *mut WebPMux;
}
unsafe extern "C" {
    pub fn WebPMuxDelete(mux: *mut WebPMux);
}
unsafe extern "C" {
    pub fn WebPMuxCreateInternal(
        arg1: *const WebPData,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> *mut WebPMux;
}
unsafe extern "C" {
    pub fn WebPMuxSetChunk(
        mux: *mut WebPMux,
        fourcc: *const ::std::os::raw::c_char,
        chunk_data: *const WebPData,
        copy_data: ::std::os::raw::c_int,
    ) -> WebPMuxError;
}
unsafe extern "C" {
    pub fn WebPMuxGetChunk(
        mux: *const WebPMux,
        fourcc: *const ::std::os::raw::c_char,
        chunk_data: *mut WebPData,
    ) -> WebPMuxError;
}
unsafe extern "C" {
    pub fn WebPMuxDeleteChunk(
        mux: *mut WebPMux,
        fourcc: *const ::std::os::raw::c_char,
    ) -> WebPMuxError;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPMuxFrameInfo {
    pub bitstream: WebPData,
    pub x_offset: ::std::os::raw::c_int,
    pub y_offset: ::std::os::raw::c_int,
    pub duration: ::std::os::raw::c_int,
    pub id: WebPChunkId,
    pub dispose_method: WebPMuxAnimDispose,
    pub blend_method: WebPMuxAnimBlend,
    pub pad: [u32; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPMuxFrameInfo"][::std::mem::size_of::<WebPMuxFrameInfo>() - 48usize];
    ["Alignment of WebPMuxFrameInfo"][::std::mem::align_of::<WebPMuxFrameInfo>() - 8usize];
    ["Offset of field: WebPMuxFrameInfo::bitstream"]
        [::std::mem::offset_of!(WebPMuxFrameInfo, bitstream) - 0usize];
    ["Offset of field: WebPMuxFrameInfo::x_offset"]
        [::std::mem::offset_of!(WebPMuxFrameInfo, x_offset) - 16usize];
    ["Offset of field: WebPMuxFrameInfo::y_offset"]
        [::std::mem::offset_of!(WebPMuxFrameInfo, y_offset) - 20usize];
    ["Offset of field: WebPMuxFrameInfo::duration"]
        [::std::mem::offset_of!(WebPMuxFrameInfo, duration) - 24usize];
    ["Offset of field: WebPMuxFrameInfo::id"]
        [::std::mem::offset_of!(WebPMuxFrameInfo, id) - 28usize];
    ["Offset of field: WebPMuxFrameInfo::dispose_method"]
        [::std::mem::offset_of!(WebPMuxFrameInfo, dispose_method) - 32usize];
    ["Offset of field: WebPMuxFrameInfo::blend_method"]
        [::std::mem::offset_of!(WebPMuxFrameInfo, blend_method) - 36usize];
    ["Offset of field: WebPMuxFrameInfo::pad"]
        [::std::mem::offset_of!(WebPMuxFrameInfo, pad) - 40usize];
};
unsafe extern "C" {
    pub fn WebPMuxSetImage(
        mux: *mut WebPMux,
        bitstream: *const WebPData,
        copy_data: ::std::os::raw::c_int,
    ) -> WebPMuxError;
}
unsafe extern "C" {
    pub fn WebPMuxPushFrame(
        mux: *mut WebPMux,
        frame: *const WebPMuxFrameInfo,
        copy_data: ::std::os::raw::c_int,
    ) -> WebPMuxError;
}
unsafe extern "C" {
    pub fn WebPMuxGetFrame(
        mux: *const WebPMux,
        nth: u32,
        frame: *mut WebPMuxFrameInfo,
    ) -> WebPMuxError;
}
unsafe extern "C" {
    pub fn WebPMuxDeleteFrame(mux: *mut WebPMux, nth: u32) -> WebPMuxError;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPMuxAnimParams {
    pub bgcolor: u32,
    pub loop_count: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPMuxAnimParams"][::std::mem::size_of::<WebPMuxAnimParams>() - 8usize];
    ["Alignment of WebPMuxAnimParams"][::std::mem::align_of::<WebPMuxAnimParams>() - 4usize];
    ["Offset of field: WebPMuxAnimParams::bgcolor"]
        [::std::mem::offset_of!(WebPMuxAnimParams, bgcolor) - 0usize];
    ["Offset of field: WebPMuxAnimParams::loop_count"]
        [::std::mem::offset_of!(WebPMuxAnimParams, loop_count) - 4usize];
};
unsafe extern "C" {
    pub fn WebPMuxSetAnimationParams(
        mux: *mut WebPMux,
        params: *const WebPMuxAnimParams,
    ) -> WebPMuxError;
}
unsafe extern "C" {
    pub fn WebPMuxGetAnimationParams(
        mux: *const WebPMux,
        params: *mut WebPMuxAnimParams,
    ) -> WebPMuxError;
}
unsafe extern "C" {
    pub fn WebPMuxSetCanvasSize(
        mux: *mut WebPMux,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
    ) -> WebPMuxError;
}
unsafe extern "C" {
    pub fn WebPMuxGetCanvasSize(
        mux: *const WebPMux,
        width: *mut ::std::os::raw::c_int,
        height: *mut ::std::os::raw::c_int,
    ) -> WebPMuxError;
}
unsafe extern "C" {
    pub fn WebPMuxGetFeatures(mux: *const WebPMux, flags: *mut u32) -> WebPMuxError;
}
unsafe extern "C" {
    pub fn WebPMuxNumChunks(
        mux: *const WebPMux,
        id: WebPChunkId,
        num_elements: *mut ::std::os::raw::c_int,
    ) -> WebPMuxError;
}
unsafe extern "C" {
    pub fn WebPMuxAssemble(mux: *mut WebPMux, assembled_data: *mut WebPData) -> WebPMuxError;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPAnimEncoder {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPAnimEncoderOptions {
    pub anim_params: WebPMuxAnimParams,
    pub minimize_size: ::std::os::raw::c_int,
    pub kmin: ::std::os::raw::c_int,
    pub kmax: ::std::os::raw::c_int,
    pub allow_mixed: ::std::os::raw::c_int,
    pub verbose: ::std::os::raw::c_int,
    pub padding: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPAnimEncoderOptions"][::std::mem::size_of::<WebPAnimEncoderOptions>() - 44usize];
    ["Alignment of WebPAnimEncoderOptions"]
        [::std::mem::align_of::<WebPAnimEncoderOptions>() - 4usize];
    ["Offset of field: WebPAnimEncoderOptions::anim_params"]
        [::std::mem::offset_of!(WebPAnimEncoderOptions, anim_params) - 0usize];
    ["Offset of field: WebPAnimEncoderOptions::minimize_size"]
        [::std::mem::offset_of!(WebPAnimEncoderOptions, minimize_size) - 8usize];
    ["Offset of field: WebPAnimEncoderOptions::kmin"]
        [::std::mem::offset_of!(WebPAnimEncoderOptions, kmin) - 12usize];
    ["Offset of field: WebPAnimEncoderOptions::kmax"]
        [::std::mem::offset_of!(WebPAnimEncoderOptions, kmax) - 16usize];
    ["Offset of field: WebPAnimEncoderOptions::allow_mixed"]
        [::std::mem::offset_of!(WebPAnimEncoderOptions, allow_mixed) - 20usize];
    ["Offset of field: WebPAnimEncoderOptions::verbose"]
        [::std::mem::offset_of!(WebPAnimEncoderOptions, verbose) - 24usize];
    ["Offset of field: WebPAnimEncoderOptions::padding"]
        [::std::mem::offset_of!(WebPAnimEncoderOptions, padding) - 28usize];
};
unsafe extern "C" {
    pub fn WebPAnimEncoderOptionsInitInternal(
        arg1: *mut WebPAnimEncoderOptions,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPAnimEncoderNewInternal(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: *const WebPAnimEncoderOptions,
        arg4: ::std::os::raw::c_int,
    ) -> *mut WebPAnimEncoder;
}
unsafe extern "C" {
    pub fn WebPAnimEncoderAdd(
        enc: *mut WebPAnimEncoder,
        frame: *mut WebPPicture,
        timestamp_ms: ::std::os::raw::c_int,
        config: *const WebPConfig,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPAnimEncoderAssemble(
        enc: *mut WebPAnimEncoder,
        webp_data: *mut WebPData,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPAnimEncoderGetError(enc: *mut WebPAnimEncoder) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn WebPAnimEncoderDelete(enc: *mut WebPAnimEncoder);
}
unsafe extern "C" {
    pub fn WebPAnimEncoderSetChunk(
        enc: *mut WebPAnimEncoder,
        fourcc: *const ::std::os::raw::c_char,
        chunk_data: *const WebPData,
        copy_data: ::std::os::raw::c_int,
    ) -> WebPMuxError;
}
unsafe extern "C" {
    pub fn WebPAnimEncoderGetChunk(
        enc: *const WebPAnimEncoder,
        fourcc: *const ::std::os::raw::c_char,
        chunk_data: *mut WebPData,
    ) -> WebPMuxError;
}
unsafe extern "C" {
    pub fn WebPAnimEncoderDeleteChunk(
        enc: *mut WebPAnimEncoder,
        fourcc: *const ::std::os::raw::c_char,
    ) -> WebPMuxError;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPDemuxer {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn WebPGetDemuxVersion() -> ::std::os::raw::c_int;
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum WebPDemuxState {
    WEBP_DEMUX_PARSE_ERROR = -1,
    WEBP_DEMUX_PARSING_HEADER = 0,
    WEBP_DEMUX_PARSED_HEADER = 1,
    WEBP_DEMUX_DONE = 2,
}
unsafe extern "C" {
    pub fn WebPDemuxInternal(
        arg1: *const WebPData,
        arg2: ::std::os::raw::c_int,
        arg3: *mut WebPDemuxState,
        arg4: ::std::os::raw::c_int,
    ) -> *mut WebPDemuxer;
}
unsafe extern "C" {
    pub fn WebPDemuxDelete(dmux: *mut WebPDemuxer);
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum WebPFormatFeature {
    WEBP_FF_FORMAT_FLAGS = 0,
    WEBP_FF_CANVAS_WIDTH = 1,
    WEBP_FF_CANVAS_HEIGHT = 2,
    WEBP_FF_LOOP_COUNT = 3,
    WEBP_FF_BACKGROUND_COLOR = 4,
    WEBP_FF_FRAME_COUNT = 5,
}
unsafe extern "C" {
    pub fn WebPDemuxGetI(dmux: *const WebPDemuxer, feature: WebPFormatFeature) -> u32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPIterator {
    pub frame_num: ::std::os::raw::c_int,
    pub num_frames: ::std::os::raw::c_int,
    pub x_offset: ::std::os::raw::c_int,
    pub y_offset: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub duration: ::std::os::raw::c_int,
    pub dispose_method: WebPMuxAnimDispose,
    pub complete: ::std::os::raw::c_int,
    pub fragment: WebPData,
    pub has_alpha: ::std::os::raw::c_int,
    pub blend_method: WebPMuxAnimBlend,
    pub pad: [u32; 2usize],
    pub private_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPIterator"][::std::mem::size_of::<WebPIterator>() - 80usize];
    ["Alignment of WebPIterator"][::std::mem::align_of::<WebPIterator>() - 8usize];
    ["Offset of field: WebPIterator::frame_num"]
        [::std::mem::offset_of!(WebPIterator, frame_num) - 0usize];
    ["Offset of field: WebPIterator::num_frames"]
        [::std::mem::offset_of!(WebPIterator, num_frames) - 4usize];
    ["Offset of field: WebPIterator::x_offset"]
        [::std::mem::offset_of!(WebPIterator, x_offset) - 8usize];
    ["Offset of field: WebPIterator::y_offset"]
        [::std::mem::offset_of!(WebPIterator, y_offset) - 12usize];
    ["Offset of field: WebPIterator::width"][::std::mem::offset_of!(WebPIterator, width) - 16usize];
    ["Offset of field: WebPIterator::height"]
        [::std::mem::offset_of!(WebPIterator, height) - 20usize];
    ["Offset of field: WebPIterator::duration"]
        [::std::mem::offset_of!(WebPIterator, duration) - 24usize];
    ["Offset of field: WebPIterator::dispose_method"]
        [::std::mem::offset_of!(WebPIterator, dispose_method) - 28usize];
    ["Offset of field: WebPIterator::complete"]
        [::std::mem::offset_of!(WebPIterator, complete) - 32usize];
    ["Offset of field: WebPIterator::fragment"]
        [::std::mem::offset_of!(WebPIterator, fragment) - 40usize];
    ["Offset of field: WebPIterator::has_alpha"]
        [::std::mem::offset_of!(WebPIterator, has_alpha) - 56usize];
    ["Offset of field: WebPIterator::blend_method"]
        [::std::mem::offset_of!(WebPIterator, blend_method) - 60usize];
    ["Offset of field: WebPIterator::pad"][::std::mem::offset_of!(WebPIterator, pad) - 64usize];
    ["Offset of field: WebPIterator::private_"]
        [::std::mem::offset_of!(WebPIterator, private_) - 72usize];
};
unsafe extern "C" {
    pub fn WebPDemuxGetFrame(
        dmux: *const WebPDemuxer,
        frame_number: ::std::os::raw::c_int,
        iter: *mut WebPIterator,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPDemuxNextFrame(iter: *mut WebPIterator) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPDemuxPrevFrame(iter: *mut WebPIterator) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPDemuxReleaseIterator(iter: *mut WebPIterator);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPChunkIterator {
    pub chunk_num: ::std::os::raw::c_int,
    pub num_chunks: ::std::os::raw::c_int,
    pub chunk: WebPData,
    pub pad: [u32; 6usize],
    pub private_: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPChunkIterator"][::std::mem::size_of::<WebPChunkIterator>() - 56usize];
    ["Alignment of WebPChunkIterator"][::std::mem::align_of::<WebPChunkIterator>() - 8usize];
    ["Offset of field: WebPChunkIterator::chunk_num"]
        [::std::mem::offset_of!(WebPChunkIterator, chunk_num) - 0usize];
    ["Offset of field: WebPChunkIterator::num_chunks"]
        [::std::mem::offset_of!(WebPChunkIterator, num_chunks) - 4usize];
    ["Offset of field: WebPChunkIterator::chunk"]
        [::std::mem::offset_of!(WebPChunkIterator, chunk) - 8usize];
    ["Offset of field: WebPChunkIterator::pad"]
        [::std::mem::offset_of!(WebPChunkIterator, pad) - 24usize];
    ["Offset of field: WebPChunkIterator::private_"]
        [::std::mem::offset_of!(WebPChunkIterator, private_) - 48usize];
};
unsafe extern "C" {
    pub fn WebPDemuxGetChunk(
        dmux: *const WebPDemuxer,
        fourcc: *const ::std::os::raw::c_char,
        chunk_number: ::std::os::raw::c_int,
        iter: *mut WebPChunkIterator,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPDemuxNextChunk(iter: *mut WebPChunkIterator) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPDemuxPrevChunk(iter: *mut WebPChunkIterator) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPDemuxReleaseChunkIterator(iter: *mut WebPChunkIterator);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPAnimDecoder {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPAnimDecoderOptions {
    pub color_mode: WEBP_CSP_MODE,
    pub use_threads: ::std::os::raw::c_int,
    pub padding: [u32; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPAnimDecoderOptions"][::std::mem::size_of::<WebPAnimDecoderOptions>() - 36usize];
    ["Alignment of WebPAnimDecoderOptions"]
        [::std::mem::align_of::<WebPAnimDecoderOptions>() - 4usize];
    ["Offset of field: WebPAnimDecoderOptions::color_mode"]
        [::std::mem::offset_of!(WebPAnimDecoderOptions, color_mode) - 0usize];
    ["Offset of field: WebPAnimDecoderOptions::use_threads"]
        [::std::mem::offset_of!(WebPAnimDecoderOptions, use_threads) - 4usize];
    ["Offset of field: WebPAnimDecoderOptions::padding"]
        [::std::mem::offset_of!(WebPAnimDecoderOptions, padding) - 8usize];
};
unsafe extern "C" {
    pub fn WebPAnimDecoderOptionsInitInternal(
        arg1: *mut WebPAnimDecoderOptions,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPAnimDecoderNewInternal(
        arg1: *const WebPData,
        arg2: *const WebPAnimDecoderOptions,
        arg3: ::std::os::raw::c_int,
    ) -> *mut WebPAnimDecoder;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WebPAnimInfo {
    pub canvas_width: u32,
    pub canvas_height: u32,
    pub loop_count: u32,
    pub bgcolor: u32,
    pub frame_count: u32,
    pub pad: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WebPAnimInfo"][::std::mem::size_of::<WebPAnimInfo>() - 36usize];
    ["Alignment of WebPAnimInfo"][::std::mem::align_of::<WebPAnimInfo>() - 4usize];
    ["Offset of field: WebPAnimInfo::canvas_width"]
        [::std::mem::offset_of!(WebPAnimInfo, canvas_width) - 0usize];
    ["Offset of field: WebPAnimInfo::canvas_height"]
        [::std::mem::offset_of!(WebPAnimInfo, canvas_height) - 4usize];
    ["Offset of field: WebPAnimInfo::loop_count"]
        [::std::mem::offset_of!(WebPAnimInfo, loop_count) - 8usize];
    ["Offset of field: WebPAnimInfo::bgcolor"]
        [::std::mem::offset_of!(WebPAnimInfo, bgcolor) - 12usize];
    ["Offset of field: WebPAnimInfo::frame_count"]
        [::std::mem::offset_of!(WebPAnimInfo, frame_count) - 16usize];
    ["Offset of field: WebPAnimInfo::pad"][::std::mem::offset_of!(WebPAnimInfo, pad) - 20usize];
};
unsafe extern "C" {
    pub fn WebPAnimDecoderGetInfo(
        dec: *const WebPAnimDecoder,
        info: *mut WebPAnimInfo,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPAnimDecoderGetNext(
        dec: *mut WebPAnimDecoder,
        buf: *mut *mut u8,
        timestamp: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPAnimDecoderHasMoreFrames(dec: *const WebPAnimDecoder) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WebPAnimDecoderReset(dec: *mut WebPAnimDecoder);
}
unsafe extern "C" {
    pub fn WebPAnimDecoderGetDemuxer(dec: *const WebPAnimDecoder) -> *const WebPDemuxer;
}
unsafe extern "C" {
    pub fn WebPAnimDecoderDelete(dec: *mut WebPAnimDecoder);
}
